In [1]:
!pip install lightfm
import lightfm
import pandas as pd
import numpy as np
import time

Requirement already satisfied: lightfm in c:\users\suyeon\miniconda3\lib\site-packages (1.16)
Requirement already satisfied: scikit-learn in c:\users\suyeon\miniconda3\lib\site-packages (from lightfm) (1.1.2)
Requirement already satisfied: requests in c:\users\suyeon\miniconda3\lib\site-packages (from lightfm) (2.27.1)
Requirement already satisfied: scipy>=0.17.0 in c:\users\suyeon\miniconda3\lib\site-packages (from lightfm) (1.9.3)
Requirement already satisfied: numpy in c:\users\suyeon\miniconda3\lib\site-packages (from lightfm) (1.23.3)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\suyeon\miniconda3\lib\site-packages (from requests->lightfm) (2022.9.24)
Requirement already satisfied: charset-normalizer~=2.0.0 in c:\users\suyeon\miniconda3\lib\site-packages (from requests->lightfm) (2.0.4)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\suyeon\miniconda3\lib\site-packages (from requests->lightfm) (1.26.12)
Requirement already satisfied: idna<4,>=2.5 in c:\users\suyeon\miniconda3\lib\site-packages (from requests->lightfm) (3.3)
Requirement already satisfied: joblib>=1.0.0 in c:\users\suyeon\miniconda3\lib\site-packages (from scikit-learn->lightfm) (1.2.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\suyeon\miniconda3\lib\site-packages (from scikit-learn->lightfm) (3.1.0)

C:\Users\suyeon\miniconda3\lib\site-packages\lightfm\_lightfm_fast.py:9: UserWarning: LightFM was compiled without OpenMP support. Only a single thread will be used.
  warnings.warn(

In [2]:
books = pd.read_csv('../../data/books.csv')
users = pd.read_csv('../../data/users.csv')
ratings = pd.read_csv('../../data/train_ratings.csv')
users.head()

   user_id                            location   age
0        8            timmins, ontario, canada   NaN
1    11400             ottawa, ontario, canada  49.0
2    11676                       n/a, n/a, n/a   NaN
3    67544            toronto, ontario, canada  30.0
4    85526  victoria, british columbia, canada  36.0

In [3]:
books.shape

(149570, 10)

In [4]:
# user_rating = ratings.merge(users, how='left',left_on = 'user_id', right_on = 'user_id')
# df = user_rating.merge(books, how='left', left_on = 'isbn', right_on = 'isbn')
# df.head()

In [5]:
# df.isnull().sum()

In [6]:
users.isna().sum()

user_id         0
location        0
age         27833
dtype: int64

In [7]:
users['location'] = users['location'].str.replace(r'[^0-9a-zA-Z:,]', '') # 특수문자 제거

users['location_city'] = users['location'].apply(lambda x: x.split(',')[0].strip())
users['location_state'] = users['location'].apply(lambda x: x.split(',')[1].strip())
users['location_country'] = users['location'].apply(lambda x: x.split(',')[2].strip())

users = users.replace('na', np.nan) #특수문자 제거로 n/a가 na로 바뀌게 되었습니다. 따라서 이를 컴퓨터가 인식할 수 있는 결측값으로 변환합니다.
users = users.replace('', np.nan) # 일부 경우 , , ,으로 입력된 경우가 있었으므로 이런 경우에도 결측값으로 변환합니다.

C:\Users\suyeon\AppData\Local\Temp\ipykernel_4208\3844664685.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  users['location'] = users['location'].str.replace(r'[^0-9a-zA-Z:,]', '') # 특수문자 제거

In [8]:
users.head()

,user_id,location,age,location_city,location_state,location_country
0,8,"timmins,ontario,canada",NaN,timmins,ontario,canada
1,11400,"ottawa,ontario,canada",49.0,ottawa,ontario,canada
2,11676,"na,na,na",NaN,NaN,NaN,NaN
3,67544,"toronto,ontario,canada",30.0,toronto,ontario,canada
4,85526,"victoria,britishcolumbia,canada",36.0,victoria,britishcolumbia,canada

In [9]:
users['age'] = users['age'].fillna(users.mean()['age'])

C:\Users\suyeon\AppData\Local\Temp\ipykernel_4208\3978783657.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  users['age'] = users['age'].fillna(users.mean()['age'])

In [10]:
users.isna().sum()

user_id                0
location               0
age                    0
location_city        122
location_state      3254
location_country    2124
dtype: int64

In [11]:
users.head()

,user_id,location,age,location_city,location_state,location_country
0,8,"timmins,ontario,canada",36.069873,timmins,ontario,canada
1,11400,"ottawa,ontario,canada",49.000000,ottawa,ontario,canada
2,11676,"na,na,na",36.069873,NaN,NaN,NaN
3,67544,"toronto,ontario,canada",30.000000,toronto,ontario,canada
4,85526,"victoria,britishcolumbia,canada",36.000000,victoria,britishcolumbia,canada

In [12]:
modify_location = users[(users['location_country'].isna())&(users['location_city'].notnull())]['location_city'].values
location = users[(users['location'].str.contains('seattle'))&(users['location_country'].notnull())]['location'].value_counts().index[0]

location_list = []
for location in modify_location:
    try:
        right_location = users[(users['location'].str.contains(location))&(users['location_country'].notnull())]['location'].value_counts().index[0]
        location_list.append(right_location)
    except:
        pass

In [13]:
for location in location_list:
    users.loc[users[users['location_city']==location.split(',')[0]].index,'location_state'] = location.split(',')[1]
    users.loc[users[users['location_city']==location.split(',')[0]].index,'location_country'] = location.split(',')[2]

In [14]:
users.isna().sum()

user_id                0
location               0
age                    0
location_city        122
location_state      1132
location_country     271
dtype: int64

users.head()

In [15]:
users = users.drop(['location'], axis=1)
users.head()

   user_id        age location_city   location_state location_country
0        8  36.069873       timmins          ontario           canada
1    11400  49.000000        ottawa          ontario           canada
2    11676  36.069873           NaN              NaN              NaN
3    67544  30.000000       toronto          ontario           canada
4    85526  36.000000      victoria  britishcolumbia           canada

In [16]:
users_copy = users.copy()

In [17]:
col = ['user_id','age','location_country','location_state','location_city']
users = pd.DataFrame(columns=col)
users['user_id'] = users_copy['user_id']
users['age'] = users_copy['age']
users['location_country'] = users_copy['location_country']
users['location_state'] = users_copy['location_state']
users['location_city'] = users_copy['location_city']
users.head()

   user_id        age location_country   location_state location_city
0        8  36.069873           canada          ontario       timmins
1    11400  49.000000           canada          ontario        ottawa
2    11676  36.069873              NaN              NaN           NaN
3    67544  30.000000           canada          ontario       toronto
4    85526  36.000000           canada  britishcolumbia      victoria

In [18]:
users = users.dropna()

In [19]:
users.isna().sum()

user_id             0
age                 0
location_country    0
location_state      0
location_city       0
dtype: int64

In [20]:
users.head()

   user_id        age location_country   location_state location_city
0        8  36.069873           canada          ontario       timmins
1    11400  49.000000           canada          ontario        ottawa
3    67544  30.000000           canada          ontario       toronto
4    85526  36.000000           canada  britishcolumbia      victoria
5    96054  29.000000           canada          ontario        ottawa

In [21]:
publisher_dict=(books['publisher'].value_counts()).to_dict()
publisher_count_df= pd.DataFrame(list(publisher_dict.items()),columns = ['publisher','count'])

publisher_count_df = publisher_count_df.sort_values(by=['count'], ascending = False)

In [22]:
publisher_count_df.head()

          publisher  count
0         Harlequin   3005
1  Ballantine Books   2322
2            Pocket   2274
3     Penguin Books   1943
4      Bantam Books   1938

In [23]:
books[books['publisher']=="Penguin Books"]

,isbn,book_title,book_author,year_of_publication,publisher,img_url,language,category,summary,img_path
68,0140067477,The Tao of Pooh,Benjamin Hoff,1983.0,Penguin Books,http://images.amazon.com/images/P/0140067477.0...,en,['Humor'],An expert in Chinese philosophy explains facet...,images/0140067477.01.THUMBZZZ.jpg
119,0143034359,Thursday Next in the Well Of Lost Plots (Thurs...,Fforde Jasper,2004.0,Penguin Books,http://images.amazon.com/images/P/0143034359.0...,en,['Fiction'],Exhausted by her stint as Miss Havisham&#39;s ...,images/0143034359.01.THUMBZZZ.jpg
157,0140250964,Snow Angels,Stewart O'Nan,1995.0,Penguin Books,http://images.amazon.com/images/P/0140250964.0...,en,['Fiction'],Weaves together two stories in the account of ...,images/0140250964.01.THUMBZZZ.jpg
196,0140272100,Vanished,Mary McGarry Morris,1997.0,Penguin Books,http://images.amazon.com/images/P/0140272100.0...,en,['Fiction'],Aubrey Wallace is the kind of man no one notices.,images/0140272100.01.THUMBZZZ.jpg
298,014028009X,Bridget Jones's Diary,Helen Fielding,1999.0,Penguin Books,http://images.amazon.com/images/P/014028009X.0...,en,['Fiction'],This witty national bestseller is now availabl...,images/014028009X.01.THUMBZZZ.jpg
...,...,...,...,...,...,...,...,...,...,...
149154,0140423818,Lord Byron: Selected Poems (Penguin Classics),George Gordon Byron,1996.0,Penguin Books,http://images.amazon.com/images/P/0140423818.0...,en,['Poetry'],&quot; &quot;Byron&#39;s contemporary populari...,images/0140423818.01.THUMBZZZ.jpg
149301,0140290788,Time Out Chicago (Time Out Chicago),Time Out,2000.0,Penguin Books,http://images.amazon.com/images/P/0140290788.0...,NaN,NaN,NaN,images/0140290788.01.THUMBZZZ.jpg
149345,0140182551,The Old Wives' Tale (20th Century Classics),Arnold Bennett,1990.0,Penguin Books,http://images.amazon.com/images/P/0140182551.0...,en,['Fiction'],Victorian novel set in the pottery district of...,images/0140182551.01.THUMBZZZ.jpg
149387,0140390715,The Pathfinder (Penguin Classic),James Fenimore Cooper,1989.0,Penguin Books,http://images.amazon.com/images/P/0140390715.0...,en,['Fiction'],Cooper undertakes a &quot;hazardous experiment...,images/0140390715.01.THUMBZZZ.jpg
149471,0140134212,House of glass: A novel (Penguin international...,Pramoedya Ananta Toer,1992.0,Penguin Books,http://images.amazon.com/images/P/0140134212.0...,NaN,NaN,NaN,images/0140134212.01.THUMBZZZ.jpg

In [24]:
books['publisher'].nunique() # 수정전 항목 수를 확인합니다.

11571

In [25]:
books[books['isbn'].apply(lambda x: x[:4])=='0140']['publisher'].unique()

array(['Penguin Books', 'Penguin Books Ltd', 'Puffin Books',
       'Penguin USA (Paper)', 'Penguin USA', 'Puffin',
       'Penguin Putnam~trade', 'Penguin Putnam~mass',
       'Penguin/Puffin Mass Market (Mm)', 'Viking Books',
       'Penguin Books Australia Ltd', 'Penguin Uk',
       'Scott Foresman (Pearson K-12)',
       'Penguin Putnam Books for Young Readers',
       'French & European Pubns', 'Viking Penguin', 'Arkana',
       'Penguin Highbridge Audio', 'Penguin (Non-Classics)',
       'Penguin Books, Limited (UK)', 'Viking Press', 'Penguin U S A',
       'Penguin/Puffin Mass Market', 'Select Penguin (Mm)',
       'Penguin Putnam', 'Penguin Books India', 'Select Penguin',
       'Penguin Books Australia Ltd.', 'Viking Penguin Inc',
       'Penguin Audiobooks', 'Studio Books', 'Penguin',
       'Hyperion Books for Children', 'Putnam Pub Group', 'Penguin India',
       'Compass Books', 'Penguin Putnam~childrens Hc',
       'Penguin in association with Secker and Warburg', 'Time Out',
       'Perennial', 'Viking Juvenile', 'Virago Press', 'South Asia Books',
       'RoC', 'Penguin Books Canada Ltd', 'Penguin Books (NZ) Ltd',
       'Ballantine Books', 'Outlet', 'Penguin USA (J)', 'Books Britain',
       'Speak', 'Penguin USA (P)', 'Penguin Books / Granta',
       'Granta Books', 'Trafalgar Square Publishing', 'Vintage Books',
       'Penguin Highbridge', 'Intl Center for Creative Thinking',
       'Penguin Group USA', 'Time Out Publishing', 'Penguin Books (NZ)',
       'Pelican Publishing Company', 'Pearson Schools', 'Dutton Books',
       'Viking Studio', 'Penguin Books Canada',
       'Granta Books in association with Penguin Books', 'Terra Nova Pr'],
      dtype=object)

In [26]:
modify_list = publisher_count_df[publisher_count_df['count']>1].publisher.values

In [27]:
for publisher in modify_list:
    try:
        number = books[books['publisher']==publisher]['isbn'].apply(lambda x: x[:4]).value_counts().index[0]
        right_publisher = books[books['isbn'].apply(lambda x: x[:4])==number]['publisher'].value_counts().index[0]
        books.loc[books[books['isbn'].apply(lambda x: x[:4])==number].index,'publisher'] = right_publisher
    except: 
        pass

In [28]:
books['publisher'].nunique() #수정 후 출판사 갯수입니다

1523

In [29]:
books.isna().sum()

isbn                       0
book_title                 0
book_author                0
year_of_publication        0
publisher                  0
img_url                    0
language               67227
category               68851
summary                67227
img_path                   0
dtype: int64

In [30]:
import re
books.loc[books[books['category'].notnull()].index, 'category'] = books[books['category'].notnull()]['category'].apply(lambda x: re.sub('[\W_]+',' ',x).strip())

In [31]:
books['category'].value_counts()

Fiction                                            32956
Juvenile Fiction                                    5804
Biography Autobiography                             3320
History                                             1925
Religion                                            1818
                                                   ...
Eschatology                                            1
Dogsledding                                            1
Brenner Simon Fictitious character                     1
Gone with the wind Motion picture 1939                 1
Authors Canadian English 20th century Biography        1
Name: category, Length: 4137, dtype: int64

In [32]:
books['category'] = books['category'].str.lower()

In [33]:
books['category'].value_counts()

fiction                                            33016
juvenile fiction                                    5835
biography autobiography                             3326
history                                             1927
religion                                            1818
                                                   ...
brenner simon fictitious character                     1
gone with the wind motion picture 1939                 1
disguise                                               1
country lawyers                                        1
authors canadian english 20th century biography        1
Name: category, Length: 4105, dtype: int64

In [34]:
category_df = pd.DataFrame(books['category'].value_counts()).reset_index()
category_df.columns = ['category','count']
category_df.head()

                  category  count
0                  fiction  33016
1         juvenile fiction   5835
2  biography autobiography   3326
3                  history   1927
4                 religion   1818

In [35]:
category_df[category_df['count']>=10]

                      category  count
0                      fiction  33016
1             juvenile fiction   5835
2      biography autobiography   3326
3                      history   1927
4                     religion   1818
..                         ...    ...
253  children s poetry english     10
254            abused children     10
255                    courage     10
256              diary fiction     10
257            spanish fiction     10

[258 rows x 2 columns]

In [36]:
books['category_high'] = books['category'].copy()
books.loc[books[books['category']=='biography'].index, 'category_high'] = 'biography autobiography'
books.loc[books[books['category']=='autobiography'].index,'category_high'] = 'biography autobiography'

In [37]:
books[books['category'].str.contains('history', na=False)]['category'].unique()

array(['history', 'oral history', 'natural history', 'history modern',
       'world history', 'politics history 1945', 'history asia',
       'church history', 'constitutional history'], dtype=object)

In [38]:
books.loc[books[books['category'].str.contains('history',na=False)].index,'category_high'] = 'history'

In [39]:
categories = ['garden','crafts','physics','adventure','music','fiction','nonfiction','science','science fiction','social','homicide',
 'sociology','disease','religion','christian','philosophy','psycholog','mathemat','agricult','environmental',
 'business','poetry','drama','literary','travel','motion picture','children','cook','literature','electronic',
 'humor','animal','bird','photograph','computer','house','ecology','family','architect','camp','criminal','language','india']

for category in categories:
    books.loc[books[books['category'].str.contains(category,na=False)].index,'category_high'] = category

In [40]:
category_high_df = pd.DataFrame(books['category_high'].value_counts()).reset_index()
category_high_df.columns = ['category','count']
category_high_df.head(10)

                  category  count
0                  fiction  39678
1  biography autobiography   3335
2                  history   1949
3                 religion   1824
4               nonfiction   1427
5                    humor   1291
6                   social   1271
7                 business   1146
8                     cook   1125
9         body mind spirit   1113

In [41]:
# 5개 이하인 항목은 others로 묶어주도록 하겠습니다.
others_list = category_high_df[category_high_df['count']<5]['category'].values

In [42]:
books.loc[books[books['category_high'].isin(others_list)].index, 'category_high']='others'

In [43]:
books['category'].nunique()

4105

In [44]:
books['category_high'].nunique()

412

In [45]:
books.isna().sum()

isbn                       0
book_title                 0
book_author                0
year_of_publication        0
publisher                  0
img_url                    0
language               67227
category               68851
summary                67227
img_path                   0
category_high          68851
dtype: int64

In [46]:
books = books.dropna()

In [47]:
books.isna().sum()

isbn                   0
book_title             0
book_author            0
year_of_publication    0
publisher              0
img_url                0
language               0
category               0
summary                0
img_path               0
category_high          0
dtype: int64

In [48]:
user_rating = ratings.merge(users, how='left',left_on = 'user_id', right_on = 'user_id')
df = user_rating.merge(books, how='left', left_on = 'isbn', right_on = 'isbn')
df.head()

,user_id,isbn,rating,age,location_country,location_state,location_city,book_title,book_author,year_of_publication,publisher,img_url,language,category,summary,img_path,category_high
0,8,0002005018,4,36.069873,canada,ontario,timmins,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses
1,67544,0002005018,7,30.000000,canada,ontario,toronto,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses
2,123629,0002005018,8,36.069873,canada,ontario,kingston,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses
3,200273,0002005018,8,36.069873,canada,ontario,comber,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses
4,210926,0002005018,9,36.069873,canada,ontario,guelph,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses

In [49]:
userid_unique = df['user_id'].unique()
book_unique = df['isbn'].unique()
print(len(userid_unique))

59803

In [50]:
user_to_idx = {v:k for k,v in enumerate(userid_unique)}
book_to_idx = {v:k for k,v in enumerate(book_unique)}

In [51]:
df.isna().sum()

user_id                     0
isbn                        0
rating                      0
age                     10300
location_country        10300
location_state          10300
location_city           10300
book_title             121221
book_author            121221
year_of_publication    121221
publisher              121221
img_url                121221
language               121221
category               121221
summary                121221
img_path               121221
category_high          121221
dtype: int64

In [52]:
df = df.dropna()

In [53]:
df.isna().sum()

user_id                0
isbn                   0
rating                 0
age                    0
location_country       0
location_state         0
location_city          0
book_title             0
book_author            0
year_of_publication    0
publisher              0
img_url                0
language               0
category               0
summary                0
img_path               0
category_high          0
dtype: int64

In [54]:
df['uid'] = df['user_id'].map(user_to_idx)
df['iid'] = df['isbn'].map(book_to_idx)
df.head()

,user_id,isbn,rating,age,location_country,location_state,location_city,book_title,book_author,year_of_publication,publisher,img_url,language,category,summary,img_path,category_high,uid,iid
0,8,0002005018,4,36.069873,canada,ontario,timmins,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,0,0
1,67544,0002005018,7,30.000000,canada,ontario,toronto,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,1,0
2,123629,0002005018,8,36.069873,canada,ontario,kingston,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,2,0
3,200273,0002005018,8,36.069873,canada,ontario,comber,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,3,0
4,210926,0002005018,9,36.069873,canada,ontario,guelph,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,4,0

In [55]:
# df.insert(1, 'location_city', users['location_city'])
# df.insert(2, 'location_state', users['location_state'])
# df.insert(3, 'location_country', users['location_country'])
# df.head()

In [56]:
data = df.copy().reset_index(drop=True)
data.columns = data.columns.str.lower() # 나중에 뺄 것
data.head()

,user_id,isbn,rating,age,location_country,location_state,location_city,book_title,book_author,year_of_publication,publisher,img_url,language,category,summary,img_path,category_high,uid,iid
0,8,0002005018,4,36.069873,canada,ontario,timmins,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,0,0
1,67544,0002005018,7,30.000000,canada,ontario,toronto,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,1,0
2,123629,0002005018,8,36.069873,canada,ontario,kingston,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,2,0
3,200273,0002005018,8,36.069873,canada,ontario,comber,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,3,0
4,210926,0002005018,9,36.069873,canada,ontario,guelph,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,4,0

In [57]:
data.isnull().sum()

user_id                0
isbn                   0
rating                 0
age                    0
location_country       0
location_state         0
location_city          0
book_title             0
book_author            0
year_of_publication    0
publisher              0
img_url                0
language               0
category               0
summary                0
img_path               0
category_high          0
uid                    0
iid                    0
dtype: int64

In [58]:
data.head()

,user_id,isbn,rating,age,location_country,location_state,location_city,book_title,book_author,year_of_publication,publisher,img_url,language,category,summary,img_path,category_high,uid,iid
0,8,0002005018,4,36.069873,canada,ontario,timmins,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,0,0
1,67544,0002005018,7,30.000000,canada,ontario,toronto,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,1,0
2,123629,0002005018,8,36.069873,canada,ontario,kingston,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,2,0
3,200273,0002005018,8,36.069873,canada,ontario,comber,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,3,0
4,210926,0002005018,9,36.069873,canada,ontario,guelph,Clara Callan,Richard Bruce Wright,2001.0,Collins,http://images.amazon.com/images/P/0002005018.0...,en,actresses,"In a small town in Canada, Clara Callan reluct...",images/0002005018.01.THUMBZZZ.jpg,actresses,4,0

In [59]:
data.shape

(179633, 19)

In [60]:
# ratings_source : build_interactions 에 사용
# --> [(user1, item1), (user2, item5), ... ] 
ratings_source = [(data['uid'][i], data['iid'][i]) for i in range(data.shape[0])]

In [61]:
# item_source: build_item_features 에 사용
# --> [(item1, [feature, feature, ...]), (item2, [feature, feature, ...])]
item_meta = data[['iid', 'category','language','book_author','publisher']]
item_source = [(item_meta['iid'][i],
                        [item_meta['category'][i],
                         item_meta['language'][i],
                         item_meta['book_author'][i],
                         item_meta['publisher'][i]]) for i in range(item_meta.shape[0])]

In [62]:
# user_source: build_iutem_features 에 사용
# --> [(user1, [feature, feature, ...]), (user2, [feature, feature, ...])]
user_meta = data[['uid','age','location_city','location_state','location_country']]

user_source = [(user_meta['uid'][i],
                [user_meta['age'][i],
                 user_meta['location_city'][i],
                 user_meta['location_state'][i],
                 user_meta['location_country'][i]]) for i in range(user_meta.shape[0])]

In [63]:
from lightfm.data import Dataset

dataset = Dataset()
dataset.fit(users=data['uid'].unique(),
            items=data['iid'].unique(),
            item_features=item_meta[item_meta.columns[1:]].values.flatten(),
            user_features=user_meta[user_meta.columns[1:]].values.flatten()
            )

In [64]:
item_meta.columns[1:]

Index(['category', 'language', 'book_author', 'publisher'], dtype='object')

In [65]:
interactions, weights = dataset.build_interactions(ratings_source)
item_features = dataset.build_item_features(item_source)
user_features = dataset.build_user_features(user_source)

In [66]:
from lightfm.cross_validation import random_train_test_split

In [67]:
train, test = random_train_test_split(interactions, test_percentage=0.2)
train.toarray()
test.toarray()

array([[1, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]])

In [68]:
train, test = train.tocsr().tocoo(), test.tocsr().tocoo()
train_weights = train.multiply(weights).tocoo()

In [69]:
from lightfm import LightFM

In [70]:
model = LightFM(no_components=10,
              learning_schedule='adagrad',
              loss='warp',
              learning_rate=0.05,
              random_state=42)

In [73]:
model.fit(interactions=train,
          item_features=item_features,
          user_features = user_features, 
          sample_weight=train_weights,
          epochs=100,
          verbose=False)

In [74]:
scores = []

for item_id in range(27204):
    user_ids = np.array([1])
    item_ids = np.array([item_id])
    s = model.predict(user_ids, item_ids, 
                      item_features=item_features, user_features=user_features)
    scores.append([item_ids[0], s[0]])

In [110]:
user1_score = pd.DataFrame(scores, columns=['item_id', 'score'])
user1_score.head()

   item_id      score
0        0 -49.394451
1        1 -54.527943
2        2 -53.670879
3        3 -51.295696
4        4 -54.265755

In [76]:
!pip install sklearn
from sklearn.preprocessing import MinMaxScaler

Requirement already satisfied: sklearn in c:\users\suyeon\miniconda3\lib\site-packages (0.0)
Requirement already satisfied: scikit-learn in c:\users\suyeon\miniconda3\lib\site-packages (from sklearn) (1.1.2)
Requirement already satisfied: joblib>=1.0.0 in c:\users\suyeon\miniconda3\lib\site-packages (from scikit-learn->sklearn) (1.2.0)
Requirement already satisfied: scipy>=1.3.2 in c:\users\suyeon\miniconda3\lib\site-packages (from scikit-learn->sklearn) (1.9.3)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\suyeon\miniconda3\lib\site-packages (from scikit-learn->sklearn) (3.1.0)
Requirement already satisfied: numpy>=1.17.3 in c:\users\suyeon\miniconda3\lib\site-packages (from scikit-learn->sklearn) (1.23.3)

In [77]:
normalizationFeatureScaling = MinMaxScaler()
normalizationScaling = normalizationFeatureScaling.fit_transform(user1_score.drop(['item_id'], axis=1))

In [79]:
normalizationScaling = pd.DataFrame(normalizationScaling, columns=user1_score.drop(['item_id'], axis=1).columns)

In [80]:
normalizationScaling.describe()

              score
count  27204.000000
mean       0.682650
std        0.106023
min        0.000000
25%        0.611653
50%        0.675200
75%        0.757618
max        1.000000

In [84]:
print(type(normalizationScaling))

<class 'pandas.core.frame.DataFrame'>

In [85]:
normalizationScaling.head()

      score
0  0.969373
1  0.568861
2  0.635729
3  0.821039
4  0.589317

In [88]:
normalizationScaling = normalizationScaling.mul(10)

In [89]:
normalizationScaling.head()

      score
0  9.693735
1  5.688610
2  6.357288
3  8.210392
4  5.893168

In [ ]:
# model.predict(user_ids=np.array([0,0,0,0,0]), item_ids=np.array([0,1,2,5,100]), 
#                     item_features=item_features, user_features=user_features)

In [98]:
test = pd.read_csv('../../data/' + 'test_ratings.csv')
test

       user_id        isbn  rating
0        11676  0002005018       0
1       116866  0002005018       0
2       152827  0060973129       0
3       157969  0374157065       0
4        67958  0399135782       0
...        ...         ...     ...
76694   278543  1576734218       0
76695   278563  3492223710       0
76696   278633  1896095186       0
76697   278668  8408044079       0
76698   278851  0767907566       0

[76699 rows x 3 columns]

In [108]:
test.loc[(test['user_id']==11676)].shape

(1419, 3)

In [93]:
# userid_unique = df['user_id'].unique()
# book_unique = df['isbn'].unique()
# print(len(userid_unique))

42668

In [94]:
# user_to_idx = {v:k for k,v in enumerate(userid_unique)}
# book_to_idx = {v:k for k,v in enumerate(book_unique)}

In [95]:
# test['uid'] = test['user_id'].map(user_to_idx)
# test['iid'] = test['isbn'].map(book_to_idx)
# test.head()

   user_id        isbn  rating      uid  iid
0    11676  0002005018       0      NaN  0.0
1   116866  0002005018       0   9649.0  0.0
2   152827  0060973129       0  19998.0  1.0
3   157969  0374157065       0  11968.0  2.0
4    67958  0399135782       0  24769.0  3.0

In [113]:
test['user_id'].tolist()

[11676,
 116866,
 152827,
 157969,
 67958,
 213191,
 245827,
 11676,
 263256,
 226745,
 7352,
 12923,
 13552,
 21264,
 31299,
 64535,
 70666,
 75819,
 79740,
 85534,
 100393,
 108143,
 116127,
 122251,
 128463,
 131703,
 132144,
 134863,
 136707,
 143939,
 144062,
 150400,
 154730,
 165884,
 187533,
 187944,
 217516,
 227392,
 240567,
 245616,
 250101,
 258884,
 259223,
 273979,
 6242,
 8570,
 11104,
 11676,
 36197,
 36907,
 80837,
 102359,
 144803,
 165319,
 174633,
 221232,
 252627,
 271135,
 271144,
 11676,
 79089,
 271622,
 141518,
 157118,
 14,
 4784,
 8453,
 11554,
 12264,
 13088,
 13221,
 14049,
 14461,
 20147,
 21404,
 24664,
 28091,
 28735,
 32329,
 33535,
 37538,
 40841,
 41596,
 45666,
 46398,
 49954,
 51803,
 55894,
 59994,
 60633,
 61028,
 64819,
 65145,
 65370,
 67636,
 67704,
 69378,
 70153,
 71162,
 71464,
 72030,
 74910,
 79738,
 83469,
 84682,
 89867,
 91254,
 92727,
 98655,
 104268,
 111433,
 114434,
 121070,
 127619,
 128447,
 130915,
 133645,
 136139,
 136237,
 141842,
 142600,
 144133,
 148191,
 150657,
 157783,
 159720,
 160241,
 161726,
 171506,
 172406,
 173190,
 173315,
 174657,
 175254,
 178072,
 179791,
 180149,
 180447,
 180795,
 181316,
 190885,
 191214,
 197550,
 198045,
 201521,
 204652,
 208478,
 209486,
 210695,
 216262,
 216397,
 219132,
 219949,
 225832,
 230436,
 233451,
 233857,
 233871,
 234784,
 234925,
 235506,
 235698,
 237283,
 239847,
 240541,
 242639,
 245829,
 246344,
 248566,
 249827,
 254589,
 258675,
 260897,
 261015,
 263078,
 263979,
 264415,
 267881,
 269607,
 269852,
 271364,
 22463,
 28731,
 35945,
 37511,
 41084,
 55892,
 67244,
 86680,
 107244,
 170154,
 204591,
 234162,
 234672,
 236235,
 267377,
 275195,
 1848,
 10470,
 16551,
 19085,
 30594,
 32188,
 58351,
 61935,
 67236,
 80538,
 103176,
 105925,
 106007,
 110700,
 115435,
 119205,
 132392,
 133462,
 135149,
 152015,
 161385,
 165253,
 179843,
 185006,
 191049,
 192479,
 197272,
 210035,
 225989,
 227305,
 231518,
 234879,
 235498,
 240660,
 248468,
 249058,
 254303,
 266678,
 266819,
 22255,
 31040,
 61901,
 135317,
 135965,
 147978,
 17,
 180975,
 25981,
 37168,
 234672,
 98930,
 17,
 141493,
 162639,
 175815,
 136255,
 151373,
 161903,
 119027,
 235867,
 101606,
 122519,
 237856,
 2766,
 8253,
 13850,
 17950,
 45340,
 46443,
 49204,
 55187,
 57398,
 59038,
 63545,
 72886,
 89874,
 98440,
 98468,
 101126,
 104657,
 117577,
 129641,
 137746,
 138543,
 157851,
 160509,
 168047,
 178953,
 181176,
 184299,
 192353,
 204494,
 204762,
 209160,
 209516,
 209724,
 209789,
 226847,
 234205,
 235030,
 236058,
 240567,
 246759,
 251422,
 251844,
 261611,
 2766,
 11676,
 25981,
 28945,
 65791,
 88738,
 94542,
 95173,
 124175,
 125222,
 126604,
 127359,
 132686,
 135149,
 148263,
 174807,
 180314,
 204783,
 206107,
 208510,
 214223,
 240710,
 269280,
 277722,
 20462,
 36554,
 149667,
 223096,
 258147,
 105904,
 142579,
 47316,
 204524,
 22045,
 25981,
 39440,
 59269,
 168702,
 173481,
 264031,
 264082,
 39662,
 49377,
 90657,
 106849,
 108405,
 110973,
 128732,
 165267,
 170997,
 171968,
 218836,
 232736,
 241666,
 248594,
 8870,
 16010,
 19570,
 30035,
 45315,
 82842,
 83287,
 88278,
 108405,
 128742,
 195386,
 201568,
 244484,
 256407,
 18979,
 23624,
 42256,
 72238,
 98391,
 153662,
 227520,
 91103,
 94385,
 101422,
 240144,
 35859,
 67627,
 68984,
 108306,
 135855,
 246230,
 251003,
 251501,
 260974,
 51,
 6866,
 32036,
 32524,
 36286,
 43619,
 56307,
 84882,
 119631,
 130658,
 134247,
 137589,
 159506,
 174726,
 207440,
 209373,
 224427,
 227705,
 229011,
 231251,
 232316,
 232945,
 233526,
 236172,
 269614,
 277922,
 278333,
 53,
 53,
 209229,
 58151,
 75852,
 114655,
 255092,
 259793,
 58252,
 75908,
 245988,
 11718,
 111979,
 114544,
 152186,
 152990,
 180915,
 186848,
 223154,
 241652,
 1650,
 1773,
 3026,
 7958,
 11657,
 25966,
 28204,
 30806,
 36677,
 36907,
 45557,
 49980,
 60707,
 68721,
 96009,
 96357,
 106946,
 122793,
 142970,
 144555,
 158258,
 158559,
 168804,
 194156,
 203213,
 212789,
 218379,
 227422,
 229313,
 233889,
 234622,
 244293,
 250353,
 258270,
 264152,
 269566,
 270713,
 274325,
 255679,
 118135,
 222716,
 73,
 23869,
 7082,
 9660,
 11676,
 32773,
 43157,
 72532,
 74833,
 89851,
 101731,
 132550,
 139387,
 144120,
 169979,
 180865,
 182442,
 197727,
 226965,
 231393,
 238396,
 275276,
 11451,
 44893,
 98097,
 119768,
 125009,
 145412,
 190844,
 194027,
 208890,
 218636,
 228641,
 254160,
 11676,
 39281,
 53575,
 60185,
 108379,
 128406,
 132851,
 225087,
 233642,
 42463,
 53174,
 62958,
 79441,
 203955,
 207494,
 12538,
 162855,
 193814,
 16090,
 52112,
 223605,
 83,
 244964,
 206794,
 87,
 280,
 7651,
 10134,
 13850,
 17183,
 19127,
 19132,
 29570,
 42305,
 56856,
 61854,
 62172,
 67487,
 74286,
 86290,
 102262,
 108352,
 109779,
 112570,
 113030,
 117073,
 123936,
 135418,
 139287,
 141511,
 142623,
 174503,
 185111,
 186570,
 189080,
 189939,
 192083,
 196133,
 200226,
 204864,
 211303,
 215829,
 217012,
 219209,
 228021,
 240643,
 242309,
 244359,
 247855,
 255045,
 257145,
 268300,
 276165,
 53808,
 136905,
 192494,
 92,
 136905,
 194864,
 6575,
 12154,
 22888,
 41084,
 52066,
 60259,
 88412,
 106036,
 107286,
 112001,
 113904,
 120147,
 124717,
 168387,
 169465,
 185176,
 198996,
 219703,
 240236,
 241548,
 251522,
 36135,
 79740,
 104636,
 110160,
 110973,
 125519,
 162827,
 187236,
 187801,
 204432,
 204804,
 76151,
 278202,
 11676,
 60028,
 89391,
 41403,
 99,
 45557,
 62316,
 67840,
 166123,
 208867,
 257602,
 268622,
 274308,
 5268,
 16782,
 55075,
 68156,
 81394,
 82102,
 135776,
 163851,
 172512,
 172742,
 188685,
 189279,
 191728,
 204790,
 209229,
 223156,
 276755,
 231772,
 6543,
 21484,
 28177,
 85619,
 135831,
 149268,
 212923,
 6563,
 12154,
 19433,
 22625,
 23871,
 25996,
 28222,
 39372,
 39773,
 60031,
 60621,
 61901,
 87632,
 92826,
 100115,
 101081,
 108005,
 108711,
 116223,
 121786,
 124298,
 130263,
 132389,
 135847,
 142759,
 152651,
 160670,
 162538,
 164956,
 168642,
 174918,
 179019,
 182180,
 182993,
 201141,
 204622,
 209685,
 216495,
 225255,
 226014,
 235935,
 236283,
 241799,
 248850,
 253871,
 253964,
 263325,
 263560,
 270713,
 175399,
 109,
 87141,
 10596,
 170568,
 177838,
 254863,
 114,
 2152,
 17461,
 28709,
 37311,
 37320,
 43529,
 66789,
 104469,
 118207,
 159647,
 160571,
 161250,
 183005,
 188398,
 190925,
 201674,
 224997,
 234165,
 266268,
 267703,
 114,
 223587,
 54416,
 119027,
 131098,
 33818,
 201359,
 223566,
 223879,
 225886,
 3373,
 4092,
 16106,
 29209,
 36326,
 43687,
 44728,
 46595,
 50225,
 53456,
 62966,
 72575,
 85757,
 89602,
 89874,
 91058,
 109700,
 110912,
 127244,
 128332,
 129226,
 131510,
 136762,
 138995,
 144742,
 145724,
 147451,
 158226,
 187463,
 190708,
 193499,
 194243,
 202058,
 202379,
 202942,
 204622,
 204777,
 209373,
 212853,
 215794,
 217107,
 220339,
 223154,
 223849,
 226205,
 230742,
 235282,
 240567,
 242528,
 245102,
 263877,
 272144,
 278422,
 172406,
 29209,
 100088,
 253964,
 3371,
 4017,
 11676,
 20060,
 40889,
 61901,
 125518,
 75306,
 204864,
 268544,
 148798,
 31826,
 81298,
 81434,
 87051,
 107889,
 109921,
 127036,
 130722,
 146230,
 174375,
 181781,
 187762,
 221687,
 240289,
 251651,
 255289,
 256950,
 268639,
 274061,
 98628,
 199562,
 230058,
 23652,
 35097,
 102248,
 103445,
 114341,
 240484,
 251890,
 118434,
 180591,
 6575,
 20627,
 37974,
 43246,
 146932,
 201290,
 204802,
 218721,
 165,
 11724,
 26598,
 39733,
 40914,
 60375,
 61854,
 62208,
 64564,
 75591,
 81318,
 82901,
 91832,
 101876,
 106114,
 107301,
 110165,
 110973,
 130793,
 133858,
 147687,
 154730,
 168755,
 193676,
 194514,
 200783,
 201445,
 204864,
 207727,
 208339,
 222353,
 224927,
 242216,
 265115,
 270605,
 274393,
 276231,
 33036,
 56959,
 156269,
 196039,
 196738,
 22045,
 30972,
 31826,
 78973,
 104218,
 104636,
 118457,
 230428,
 269265,
 270713,
 271460,
 51883,
 71181,
 200956,
 250709,
 24677,
 31860,
 52425,
 66917,
 78841,
 141491,
 152309,
 168954,
 176875,
 212923,
 223210,
 256603,
 270801,
 176,
 13087,
 73394,
 106271,
 253871,
 76151,
 104144,
 120405,
 138198,
 174892,
 204524,
 246196,
 183,
 183,
 8317,
 37712,
 80690,
 81207,
 144790,
 277783,
 277827,
 277828,
 55490,
 192156,
 190,
 145737,
 245698,
 203910,
 98391,
 24778,
 8864,
 115707,
 128415,
 174168,
 271542,
 231210,
 215,
 224924,
 11676,
 66387,
 104998,
 123649,
 221327,
 225087,
 929,
 11676,
 11788,
 82157,
 16790,
 21014,
 160334,
 165308,
 218241,
 11718,
 132375,
 134584,
 7125,
 55562,
 57356,
 182085,
 261829,
 46903,
 53590,
 59206,
 64448,
 126296,
 131855,
 137190,
 145644,
 162798,
 171846,
 ...]

In [ ]:
# ratings_source = [(data['uid'][i], data['iid'][i]) for i in range(data.shape[0])]

In [112]:
scores = []

for user_id,isbn in zip(test['user_id'].tolist(), test['isbn'].tolist()):
    user_ids = np.array([user_id])
    isbns = np.array([isbn])
    s = model.predict(user_ids, isbns, 
                      item_features=item_features, user_features=user_features)
    scores.append([isbns[0], s[0]])

Exception: Number of item feature rows does not equal the number of items

In [ ]:
# print(f'--------------- SAVE ightfm_model PREDICT ---------------')
# submission = pd.read_csv('../../data/' + 'sample_submission.csv')
# submission['rating'] = predicts

# now = time.localtime()
# now_date = time.strftime('%Y%m%d', now)
# now_hour = time.strftime('%X', now)
# save_time = now_date + '_' + now_hour.replace(':', '')
# submission.to_csv('submit/{}_{}.csv'.format(save_time, 'lightfm_model'), index=False)

In [ ]:
# from lightfm.evaluation import auc_score, precision_at_k, recall_at_k

In [96]:
# auc_score(model, train, 
#         item_features=item_features, 
#         user_features=user_features).mean()

NameError: name 'auc_score' is not defined

In [ ]:
# test_auc = auc_score(model, test, 
#         item_features=item_features, 
#         user_features=user_features).mean()

In [ ]:
# test_precision = precision_at_k(model, test, k=100, 
#                                 item_features=item_features,
#                                 user_features=user_features).mean()

In [ ]:
# test_recall = recall_at_k(model, test, k=100, 
#                           item_features=item_features,
#                           user_features=user_features).mean()

In [ ]:
# test_auc, test_precision, test_recall